Revit 2027 API
MacroModule.ModuleStatus Property
 The module status.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModuleStatus ModuleStatus { get; }
Public ReadOnly Property ModuleStatus As ModuleStatus
	Get
public:
property ModuleStatus ModuleStatus {
	ModuleStatus get ();
}
member ModuleStatus : ModuleStatus with get
Property Value
ModuleStatus
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace